In [2]:
import pandas as pd
import numpy as np

LOAD THE DATASET

In [5]:
df = pd.read_csv('netflix_dataset.csv')
df.head()

,show_id,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description,type
0,81193313,Chocolate,NaN,"Ha Ji-won, Yoon Kye-sang, Jang Seung-jo, Kang ...",South Korea,"November 30, 2019",2019,TV-14,1 Season,"International TV Shows, Korean TV Shows, Roman...",Brought together by meaningful meals in the pa...,TV Show
1,81197050,Guatemala: Heart of the Mayan World,"Luis Ara, Ignacio Jaunsolo",Christian Morales,NaN,"November 30, 2019",2019,TV-G,67 min,"Documentaries, International Movies","From Sierra de las Minas to Esquipulas, explor...",Movie
2,81213894,The Zoya Factor,Abhishek Sharma,"Sonam Kapoor, Dulquer Salmaan, Sanjay Kapoor, ...",India,"November 30, 2019",2019,TV-14,135 min,"Comedies, Dramas, International Movies",A goofy copywriter unwittingly convinces the I...,Movie
3,81082007,Atlantics,Mati Diop,"Mama Sane, Amadou Mbow, Ibrahima Traore, Nicol...","France, Senegal, Belgium","November 29, 2019",2019,TV-14,106 min,"Dramas, Independent Movies, International Movies","Arranged to marry a rich man, young Ada is cru...",Movie
4,80213643,Chip and Potato,NaN,"Abigail Oliver, Andrea Libman, Briana Buckmast...","Canada, United Kingdom",NaN,2019,TV-Y,2 Seasons,Kids' TV,"Lovable pug Chip starts kindergarten, makes ne...",TV Show

CHECK MISSING VALUES

In [6]:
df.isnull().sum()

show_id            0
title              0
director        1901
cast             556
country          427
date_added       642
release_year       0
rating            10
duration           0
listed_in          0
description        0
type               0
dtype: int64

In [7]:
df.isnull().sum().sum()

np.int64(3536)

# filling null values

In [69]:
df.dropna(inplace=True)
df.dropna(subset=['date_added'], inplace=True)
import pandas as pd

df = pd.read_csv("netflix_dataset.csv")

# Drop rows where 'date_added' is missing
df.dropna(subset=['date_added'], inplace=True)

# OR drop all rows with any missing value
# df.dropna(inplace=True)

In [70]:
df['director'] = df['director'].fillna("Unknown")
df['cast'] = df['cast'].fillna("Not Available")
df['country'] = df['country'].fillna("Unknown")
df['rating'] = df['rating'].fillna("Not Rated")

df['date_added'] = pd.to_datetime(df['date_added'], errors='coerce')

In [59]:
#Fill Nulls with a Placeholder
df['date_added'] = pd.to_datetime(df['date_added'], errors='coerce')
df['date_added'] = df['date_added'].fillna("Unknown")

In [64]:
df['date_added'] = pd.to_datetime(df['date_added'], errors='coerce')
df['date_added'] = df['date_added'].fillna(pd.Timestamp("2000-01-01"))

In [65]:
# Check how many are still null
df['date_added'].isnull().sum()

np.int64(0)

In [67]:
# Convert to uniform string format (optional)
df['date_added'] = df['date_added'].apply(lambda x: x.strftime('%d-%m-%Y') if pd.notnull(x) else "Unknown")

In [71]:
df.isnull().sum()

show_id         0
title           0
director        0
cast            0
country         0
date_added      0
release_year    0
rating          0
duration        0
listed_in       0
description     0
type            0
dtype: int64

# List of columns that are text-based and need standardizing

In [52]:

text_columns = ['title', 'director', 'cast', 'country', 'rating', 'duration', 'listed_in', 'description', 'type']
# Apply strip() and lower() to each of these columns
for col in text_columns:
    df[col] = df[col].astype(str).str.strip().str.lower()

In [73]:
df[text_columns].head()

,title,director,cast,country,rating,duration,listed_in,description,type
0,Chocolate,Unknown,"Ha Ji-won, Yoon Kye-sang, Jang Seung-jo, Kang ...",South Korea,TV-14,1 Season,"International TV Shows, Korean TV Shows, Roman...",Brought together by meaningful meals in the pa...,TV Show
1,Guatemala: Heart of the Mayan World,"Luis Ara, Ignacio Jaunsolo",Christian Morales,Unknown,TV-G,67 min,"Documentaries, International Movies","From Sierra de las Minas to Esquipulas, explor...",Movie
2,The Zoya Factor,Abhishek Sharma,"Sonam Kapoor, Dulquer Salmaan, Sanjay Kapoor, ...",India,TV-14,135 min,"Comedies, Dramas, International Movies",A goofy copywriter unwittingly convinces the I...,Movie
3,Atlantics,Mati Diop,"Mama Sane, Amadou Mbow, Ibrahima Traore, Nicol...","France, Senegal, Belgium",TV-14,106 min,"Dramas, Independent Movies, International Movies","Arranged to marry a rich man, young Ada is cru...",Movie
5,Crazy people,Moses Inwang,"Ramsey Nouah, Chigul, Sola Sobowale, Ireti Doy...",Nigeria,TV-14,107 min,"Comedies, International Movies, Thrillers",Nollywood star Ramsey Nouah learns that someon...,Movie

#Remove Duplicate Rows

In [30]:
df.drop_duplicates(inplace=True)

print("Before:", df.shape)

df.drop_duplicates(inplace=True)

print("After:", df.shape)

Before: (5195, 12)
After: (5195, 12)

In [31]:
duplicates = df.duplicated().sum()
print("Total duplicate rows:", duplicates)

Total duplicate rows: 0

#Convert date formates to a consistente type (e.g./ dd-mm-yyyy)

In [32]:
# Step 1: Convert to datetime (if not already)
df['date_added'] = pd.to_datetime(df['date_added'], errors='coerce')

# Step 2: Convert to desired format: dd-mm-yyyy
df['date_added'] = df['date_added'].dt.strftime('%d-%m-%Y')

In [33]:
df[['date_added']].head()

   date_added
0  30-11-2019
1  30-11-2019
2  30-11-2019
3  29-11-2019
5  29-11-2019

# Rename column headers to be clean and uniform

In [34]:
df.columns = [col.strip().lower().replace(" ", "_") for col in df.columns]

In [35]:
print(df.columns)

Index(['show_id', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description',
       'type'],
      dtype='object')

In [36]:
pd.DataFrame(df.columns, columns=["Cleaned Column Names"])

   Cleaned Column Names
0               show_id
1                 title
2              director
3                  cast
4               country
5            date_added
6          release_year
7                rating
8              duration
9             listed_in
10          description
11                 type

# Check and fix data type

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5195 entries, 0 to 5836
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       5195 non-null   int64
 1   title         5195 non-null   object
 2   director      5195 non-null   object
 3   cast          5195 non-null   object
 4   country       5195 non-null   object
 5   date_added    5195 non-null   object
 6   release_year  5195 non-null   int64
 7   rating        5195 non-null   object
 8   duration      5195 non-null   object
 9   listed_in     5195 non-null   object
 10  description   5195 non-null   object
 11  type          5195 non-null   object
dtypes: int64(2), object(10)
memory usage: 527.6+ KB

In [39]:
#Convert date_added to datetime
df['date_added'] = df['date_added'].dt.strftime('%d-%m-%Y')

#  Convert release_year to integer

In [43]:
df['release_year'] = pd.to_numeric(df['release_year'], errors='coerce').astype('Int64')

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5195 entries, 0 to 5836
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       5195 non-null   int64
 1   title         5195 non-null   object
 2   director      5195 non-null   object
 3   cast          5195 non-null   object
 4   country       5195 non-null   object
 5   date_added    5195 non-null   object
 6   release_year  5195 non-null   Int64
 7   rating        5195 non-null   object
 8   duration      5195 non-null   object
 9   listed_in     5195 non-null   object
 10  description   5195 non-null   object
 11  type          5195 non-null   object
 12  duration_num  5195 non-null   Int64
dtypes: Int64(2), int64(1), object(10)
memory usage: 578.3+ KB

In [72]:
df.isnull().sum()

show_id         0
title           0
director        0
cast            0
country         0
date_added      0
release_year    0
rating          0
duration        0
listed_in       0
description     0
type            0
dtype: int64